---
kind: type
id: T:Autodesk.Revit.DB.IntegerParameterValue
source: html/14c16038-74bf-205b-ac93-6ffa6274c034.htm
---
# Autodesk.Revit.DB.IntegerParameterValue

A class that holds an Integer value of a parameter element.

## Syntax (C#)
```csharp
public class IntegerParameterValue : ParameterValue
```